src/InformationRegisters/ar_ДействияАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ДействияАгента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_ИмяTool</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АргументыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_RiskLevel</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_RiskLevel</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ResultRef</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ApprovedBy</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ApprovedAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_RunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ar_Sequence</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ar_RiskLevel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_RiskLevel</Name>
			<Comment>Уровень риска инструмента (tool) агента: от безопасного чтения до необратимых операций</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Read</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Draft</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Write</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Commit</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ar_AuditДействия/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_AuditДействия (Аудит действий агента).
//
// Единственная точка записи журнала выполненных tool-действий агента в
// независимый регистр сведений ar_ДействияАгента. Запись делает диспетчер
// ar_ToolDispatcher после каждого вызова tool (успешного или ошибочного).
//
// Измерения регистра: ar_RunId (UUID-строка 36) + ar_Sequence (порядковый
// номер действия внутри запуска). Ресурсы: ar_ИмяTool, ar_АргументыJSON,
// ar_RiskLevel (EnumRef.ar_RiskLevel), ar_ResultRef (навигационная ссылка),
// ar_ApprovedBy (CatalogRef.Пользователи), ar_ApprovedAt (Дата).
//
// Свойства модуля: Сервер, Привилегированный = Ложь (AUD-06: платформа
// запрещает Privileged=true в общих модулях расширений - "Cannot use
// privileged common modules in extensions", проверено при загрузке .cfe в
// реальную ИБ). Привилегии поднимает вызывающий код точечно -
// УстановитьПривилегированныйРежим(Истина)/Попытка...Исключение...(Ложь)/
// КонецПопытки/(Ложь) - через фасад ar_AuditЗащищённыйРежим
// (ЗаписатьДействиеПривилегированно) там, где он подключён, либо локально в
// вызывающем модуле. Ранее (AUD-03/AUD-04/AUD-05) привилегия выставлялась
// в манифесте - см. AUD-06 для истории смены механизма. Аналогично
// ar_AuditЗапуски / ar_AuditСобытия.
//
// Модуль не выбрасывает исключений наружу: сбой записи журнала действий не
// должен валить runtime-цикл агента. При ошибке пишется запись в журнал
// регистрации и возвращается Ложь.
//
// См. спеку: .docs/specs/DISP-01.md (вариант A), AUD-03, Plan §2.8, §3.1.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Записать выполненное действие агента в регистр ar_ДействияАгента.
//
// Идемпотентна по ключу (RunId, Sequence): повторный вызов с тем же ключом
// перезаписывает запись (независимый регистр, набор по измерениям).
//
// Параметры:
//  RunId          - Строка    - идентификатор запуска (UUID, длина 36). Обязателен.
//  Sequence       - Число     - порядковый номер действия внутри запуска (>= 0).
//  ИмяTool        - Строка    - имя tool (значение реквизита ar_Имя). Обрезается до 128.
//  АргументыJSON  - Строка    - JSON-аргументы вызова (для трассировки).
//  RiskLevel      - ПеречислениеСсылка.ar_RiskLevel, Строка - уровень риска.
//                                Строка трактуется как имя значения перечисления.
//  ResultRef      - Строка, Произвольный - навигационная ссылка результата либо
//                                ссылочное значение (приводится через ar_Утилиты).
//                                Может быть пустой.
//  ДополнительныеДанные - Структура - опционально: {ApprovedBy, ApprovedAt}
//                                для commit-действий, прошедших approval. Может
//                                быть Неопределено.
//
// Возвращаемое значение:
//  Булево - Истина, если запись выполнена; Ложь при ошибке валидации/записи.
//
Функция Записать(Знач RunId, Знач Sequence, Знач ИмяTool, Знач АргументыJSON,
		Знач RiskLevel, Знач ResultRef = "", Знач ДополнительныеДанные = Неопределено) Экспорт

	Попытка

		Если ТипЗнч(RunId) <> Тип("Строка") Или ПустаяСтрока(RunId) Тогда
			ЗаписатьПредупреждение(
				НСтр("ru = 'Действие не записано: пустой RunId';
					|en = 'Action not recorded: empty RunId'"));
			Возврат Ложь;
		КонецЕсли;

		НомерДействия = ?(ТипЗнч(Sequence) = Тип("Число"), Макс(0, Цел(Sequence)), 0);

		МенеджерЗаписи = РегистрыСведений.ar_ДействияАгента.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_RunId    = Лев(RunId, 36);
		МенеджерЗаписи.ar_Sequence = НомерДействия;

		МенеджерЗаписи.ar_ИмяTool       = ar_Утилиты.ОбрезатьДо(СтрокаЗначения(ИмяTool), 128);
		МенеджерЗаписи.ar_АргументыJSON  = СтрокаЗначения(АргументыJSON);
		МенеджерЗаписи.ar_RiskLevel     = ЗначениеRiskLevel(RiskLevel);
		МенеджерЗаписи.ar_ResultRef     = ar_Утилиты.ОбрезатьДо(
			ar_Утилиты.НавигационнаяСсылкаОбъекта(ResultRef), 300);

		ЗаполнитьДанныеApproval(МенеджерЗаписи, ДополнительныеДанные);

		МенеджерЗаписи.Записать(Истина);
		Возврат Истина;

	Исключение
		ЗаписатьОшибку(
			НСтр("ru = 'Ошибка записи действия агента в ar_ДействияАгента';
				|en = 'Failed to record agent action into ar_ДействияАгента'"),
			ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполнить ресурсы approval (ApprovedBy / ApprovedAt) из дополнительных данных.
//
// Параметры:
//  МенеджерЗаписи        - РегистрСведенийМенеджерЗаписи.ar_ДействияАгента - менеджер
//                          записи, ресурсы которого заполняются данными approval.
//  ДополнительныеДанные  - Структура - {ApprovedBy, ApprovedAt} для commit-действий;
//                          может быть Неопределено или иного типа (тогда без действий).
//
Процедура ЗаполнитьДанныеApproval(МенеджерЗаписи, Знач ДополнительныеДанные)

	Если ТипЗнч(ДополнительныеДанные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ApprovedBy = Неопределено;
	Если ДополнительныеДанные.Свойство("ApprovedBy", ApprovedBy)
		И ТипЗнч(ApprovedBy) = Тип("СправочникСсылка.Пользователи") Тогда
		МенеджерЗаписи.ar_ApprovedBy = ApprovedBy;
	КонецЕсли;

	ApprovedAt = Неопределено;
	Если ДополнительныеДанные.Свойство("ApprovedAt", ApprovedAt)
		И ТипЗнч(ApprovedAt) = Тип("Дата") Тогда
		МенеджерЗаписи.ar_ApprovedAt = ApprovedAt;
	КонецЕсли;

КонецПроцедуры

// Привести RiskLevel к ПеречислениеСсылка.ar_RiskLevel.
// Строка трактуется как имя значения (Read/Draft/Write/Commit); неизвестное
// значение и пустота → Read (безопасный дефолт).
//
// Параметры:
//  RiskLevel - ПеречислениеСсылка.ar_RiskLevel, Строка - уровень риска либо имя
//              значения перечисления (Read/Draft/Write/Commit).
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ar_RiskLevel - распознанное значение либо Read по умолчанию.
//
Функция ЗначениеRiskLevel(Знач RiskLevel)

	Если ТипЗнч(RiskLevel) = Тип("ПеречислениеСсылка.ar_RiskLevel") Тогда
		Возврат RiskLevel;
	КонецЕсли;

	Если ТипЗнч(RiskLevel) = Тип("Строка") И Не ПустаяСтрока(RiskLevel) Тогда
		ЗначениеМД = Метаданные.Перечисления.ar_RiskLevel.ЗначенияПеречисления.Найти(СокрЛП(RiskLevel));
		Если ЗначениеМД <> Неопределено Тогда
			Возврат Перечисления.ar_RiskLevel[ЗначениеМД.Имя];
		КонецЕсли;
	КонецЕсли;

	Возврат Перечисления.ar_RiskLevel.Read;

КонецФункции

// Безопасно привести значение к строке (Неопределено → "").
//
// Параметры:
//  Значение - Произвольный - значение любого типа для приведения к строке.
//
// Возвращаемое значение:
//  Строка - строковое представление значения; пустая строка при Неопределено.
//
Функция СтрокаЗначения(Знач Значение)
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат Строка(Значение);
КонецФункции

// Запись ошибки в журнал регистрации с маскировкой секретов.
// Best-effort: собственный сбой логирования подавляется и не пробрасывается
// наружу, чтобы не нарушить контракт «модуль не выбрасывает исключений».
//
// Параметры:
//  Заголовок            - Строка - заголовок сообщения об ошибке для журнала.
//  ИнформацияОбОшибке   - ИнформацияОбОшибке - сведения об исключении из блока
//                         Исключение (результат ИнформацияОбОшибке()).
//
Процедура ЗаписатьОшибку(Знач Заголовок, Знач ИнформацияОбОшибке)
	Попытка
		Текст = Заголовок + ": "
			+ ar_Утилиты.МаскироватьСекреты(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_AuditДействия'; en = 'aosAuditActions'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			Текст);
	Исключение
		// Логирование - best-effort: сбой самого логирования намеренно подавляем,
		// чтобы не нарушить контракт "модуль не выбрасывает исключений наружу".
		Возврат;
	КонецПопытки;
КонецПроцедуры

// Запись предупреждения в журнал регистрации.
//
// Параметры:
//  Текст - Строка - текст предупреждения; секреты маскируются перед записью.
//
Процедура ЗаписатьПредупреждение(Знач Текст)
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'ar_AuditДействия'; en = 'aosAuditActions'"),
		УровеньЖурналаРегистрации.Предупреждение,
		,
		,
		ar_Утилиты.МаскироватьСекреты(Текст));
КонецПроцедуры

#КонецОбласти
